open-foam/tutorials/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/system/air/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airToporous
{
    type            constantHeatTransfer;
    active          on;
    selectionMode   mapRegion;
    interpolationMethod cellVolumeWeight;
    nbrRegionName   porous;
    master          false;

    constantHeatTransferCoeffs
    {
        nbrModelName    porousToair;
        fieldNames      (h);
        semiImplicit    no;
    }
}

porosityBlockage
{
    type            interRegionExplicitPorositySource;
    active          on;
    selectionMode   mapRegion;
    interpolationMethod cellVolumeWeight;
    nbrRegionName   porous;

    interRegionExplicitPorositySourceCoeffs
    {
        type            DarcyForchheimer;

        DarcyForchheimerCoeffs
        {
            d   d [0 -2 0 0 0] (-1000 -1000 1e4);
            f   f [0 -1 0 0 0] (0 0 0);

            coordinateSystem
            {
                type    cartesian;
                origin  (0 0 0);
                coordinateRotation
                {
                    type    axesRotation;
                    e1      (0 1 0);
                    e2      (0 0 1);
                }
            }
        }
    }
}

MRF1
{
    type            MRFSource;
    active          true;
    selectionMode   cellZone;
    cellZone        rotor;

    MRFSourceCoeffs
    {
        origin    (0.25 0.25 0.25);
        axis      (0 0 1);
        omega     47.7; // 50 rpm
    }
}

// ************************************************************************* //
